## `terraform/scheduling`
#### Terraform Format and Style 🖌`'No changes needed.'`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
module.custom_lambda.module.user_action_filter_function.data.external.archive_prepare[0]: Reading...
module.custom_lambda.module.user_action_filter_function.data.external.archive_prepare[0]: Read complete after 0s [id=-]
module.custom_lambda.module.user_action_filter_function.local_file.archive_plan[0]: Refreshing state... [id=421827469ade4a6f146fa8ac3fc4b3f8da27703b]
module.custom_lambda.module.user_action_filter_function.null_resource.archive[0]: Refreshing state... [id=504059938685130300]
data.aws_security_group.fargate_sg: Reading...
module.custom_lambda.module.user_action_filter_function.data.aws_partition.current: Reading...
module.custom_lambda.module.user_action_filter_function.data.aws_caller_identity.current: Reading...
module.custom_lambda.module.user_action_filter_function.data.aws_region.current: Reading...
data.aws_sns_topic.my_sns: Reading...
module.custom_cloudwatch.aws_cloudwatch_log_group.firelens: Refreshing state... [id=/aws/ecs/minecraft-firelens-logs]
module.custom_lambda.module.user_action_filter_function.data.aws_partition.current: Read complete after 0s [id=aws]
module.custom_lambda.module.user_action_filter_function.data.aws_iam_policy_document.assume_role[0]: Reading...
data.aws_iam_role.task_execution_role: Reading...
module.custom_lambda.module.user_action_filter_function.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/user-action-filter-function]
module.custom_lambda.module.user_action_filter_function.data.aws_region.current: Read complete after 0s [id=ap-northeast-1]
module.custom_ecs.aws_ecs_cluster.main: Refreshing state... [id=arn:aws:ecs:ap-northeast-1:528163014577:cluster/minecraft-test-cluster]
data.aws_vpc.myvpc: Reading...
module.custom_lambda.module.user_action_filter_function.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
data.aws_iam_role.task_role: Reading...
module.custom_domain.data.aws_route53_zone.mydomain: Reading...
data.aws_iam_role.task_role: Read complete after 0s [id=ecs_tasks-minecraft-test-role]
module.custom_lambda.module.user_action_filter_function.aws_iam_role.lambda[0]: Refreshing state... [id=user-action-filter-function]
module.custom_lambda.module.user_action_filter_function.data.aws_caller_identity.current: Read complete after 0s [id=528163014577]
data.aws_iam_role.task_execution_role: Read complete after 0s [id=minecraft-test-ecs_tasks_execution-role]
module.custom_domain.data.aws_route53_zone.mydomain: Read complete after 0s [id=Z0885897H6FS59VX1SAQ]
data.aws_sns_topic.my_sns: Read complete after 0s [id=arn:aws:sns:ap-northeast-1:528163014577:minecraft-test-sns-topic]
module.custom_lambda.module.user_action_filter_function.aws_iam_policy.additional_json[0]: Refreshing state... [id=arn:aws:iam::528163014577:policy/user-action-filter-function]
module.custom_lambda.module.user_action_filter_function.aws_iam_role_policy_attachment.additional_json[0]: Refreshing state... [id=user-action-filter-function-20231210084512126600000002]
data.aws_security_group.fargate_sg: Read complete after 1s [id=sg-0f556208fad2fcb94]
module.custom_lambda.module.user_action_filter_function.data.aws_iam_policy_document.logs[0]: Reading...
module.custom_ecs.aws_ecs_task_definition.main: Refreshing state... [id=minecraft-test]
module.custom_lambda.module.user_action_filter_function.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=1875139620]
data.aws_vpc.myvpc: Read complete after 1s [id=vpc-0ee18fc0aa8e4b408]
data.aws_subnets.my_subnets: Reading...
module.custom_nlb.module.nlb.aws_lb_target_group.main[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:528163014577:targetgroup/tf-20231210083948384500000001/1dc042ccc0776fe5]
data.aws_subnets.my_subnets: Read complete after 0s [id=ap-northeast-1]
module.custom_nlb.module.nlb.aws_lb.this[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:528163014577:loadbalancer/net/minecraft-test-nlb/91d8c053ea18aac7]
module.custom_ecs.aws_ecs_service.main: Refreshing state... [id=arn:aws:ecs:ap-northeast-1:528163014577:service/minecraft-test-cluster/minecraft-test-service]
module.custom_nlb.module.nlb.aws_lb_listener.frontend_http_tcp[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:528163014577:listener/net/minecraft-test-nlb/91d8c053ea18aac7/b881bb98aa50a846]
module.custom_domain.aws_route53_record.apps_dns: Refreshing state... [id=Z0885897H6FS59VX1SAQ_minecraft.smat710.tk_A]
module.custom_cloudwatch.aws_cloudwatch_metric_alarm.target_group_health_check: Refreshing state... [id=minecraft-test-targetgroup_healthy]
module.custom_nlb.null_resource.send_slack_notification: Refreshing state... [id=2902515532194015354]
module.custom_cloudwatch.aws_cloudwatch_metric_alarm.memory_utilization: Refreshing state... [id=minecraft-test-memory_utilization]
module.custom_cloudwatch.aws_cloudwatch_metric_alarm.task_running_count: Refreshing state... [id=minecraft-test-task_running_count]
module.custom_cloudwatch.aws_cloudwatch_metric_alarm.cpu_utilization: Refreshing state... [id=minecraft-test-cpu_utilization]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.custom_lambda.aws_cloudwatch_log_subscription_filter.user-action_subscription["0"] will be created
  + resource "aws_cloudwatch_log_subscription_filter" "user-action_subscription" {
      + destination_arn = (known after apply)
      + distribution    = "ByLogStream"
      + filter_pattern  = "{ ($.level = \"ERROR\")}"
      + id              = (known after apply)
      + log_group_name  = "/aws/ecs/minecraft-firelens-logs"
      + name            = "user-action-subscription-0"
      + role_arn        = (known after apply)
    }

  # module.custom_lambda.aws_cloudwatch_log_subscription_filter.user-action_subscription["1"] will be created
  + resource "aws_cloudwatch_log_subscription_filter" "user-action_subscription" {
      + destination_arn = (known after apply)
      + distribution    = "ByLogStream"
      + filter_pattern  = (sensitive value)
      + id              = (known after apply)
      + log_group_name  = "/aws/ecs/minecraft-firelens-logs"
      + name            = "user-action-subscription-1"
      + role_arn        = (known after apply)
    }

  # module.custom_lambda.aws_lambda_permission.log_permission will be created
  + resource "aws_lambda_permission" "log_permission" {
      + action              = "lambda:InvokeFunction"
      + function_name       = (known after apply)
      + id                  = (known after apply)
      + principal           = "logs.ap-northeast-1.amazonaws.com"
      + source_arn          = "arn:aws:logs:ap-northeast-1:528163014577:log-group:/aws/ecs/minecraft-firelens-logs:*"
      + statement_id        = (known after apply)
      + statement_id_prefix = (known after apply)
    }

  # module.custom_lambda.module.user_action_filter_function.aws_iam_policy.logs[0] will be created
  + resource "aws_iam_policy" "logs" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = "user-action-filter-function-logs"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:PutLogEvents",
                          + "logs:CreateLogStream",
                          + "logs:CreateLogGroup",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:logs:ap-northeast-1:528163014577:log-group:/aws/lambda/user-action-filter-function:*:*",
                          + "arn:aws:logs:ap-northeast-1:528163014577:log-group:/aws/lambda/user-action-filter-function:*",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # module.custom_lambda.module.user_action_filter_function.aws_iam_role_policy_attachment.logs[0] will be created
  + resource "aws_iam_role_policy_attachment" "logs" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "user-action-filter-function"
    }

  # module.custom_lambda.module.user_action_filter_function.aws_lambda_function.this[0] will be created
  + resource "aws_lambda_function" "this" {
      + architectures                  = [
          + "x86_64",
        ]
      + arn                            = (known after apply)
      + description                    = "My awsome lambda function"
      + filename                       = "builds/ea96dc4de2016fe5f3b29c4e5952cf7ed9f0d78b607e635369a8cb31b68e76c8.zip"
      + function_name                  = "user-action-filter-function"
      + handler                        = "index.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = true
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = "arn:aws:iam::528163014577:role/user-action-filter-function"
      + runtime                        = "python3.9"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 360
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "ALARM_SUBJECT" = "【UserEvent Notification】"
              + "SNS_TOPIC_ARN" = "arn:aws:sns:ap-northeast-1:528163014577:minecraft-test-sns-topic"
              + "WEB_HOOK_URL"  = (sensitive value)
            }
        }

      + ephemeral_storage {
          + size = 512
        }

      + timeouts {}
    }

Plan: 6 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>